redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_3nd/redis_result_Gauss82_F_OFF_P4_3nd20230717222057.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8032.82          ---          ---         2.49293         2.44700         4.95900         5.56700      8676.08 
Gets        32122.94     19196.81     12926.13         2.48577         2.43100         4.92700         5.56700     21561.81 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      40155.76     19196.81     12926.13         2.48720         2.43100         4.92700         5.56700     30237.89 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.271        0.000
SET       2.079        5.000
SET       2.143       10.000
SET       2.239       15.000
SET       2.319       20.000
SET       2.351       25.000
SET       2.383       30.000
SET       2.399       35.000
SET       2.415       40.000
SET       2.431       45.000
SET       2.447       50.000
SET       2.447       52.500
SET       2.463       55.000
SET       2.463       57.500
SET       2.479       60.000
SET       2.479       62.500
SET       2.479       65.000
SET       2.495       67.500
SET       2.511       70.000
SET       2.511       72.500
SET       2.527       75.000
SET       2.527       76.250
SET       2.543       77.500
SET       2.543       78.750
SET       2.543       80.000
SET       2.559       81.250
SET       2.559       82.500
SET       2.575       83.750
SET       2.575       85.000
SET       2.591       86.250
SET       2.607       87.500
SET       2.607       88.125
SET       2.623       88.750
SET       2.623       89.375
SET       2.639       90.000
SET       2.655       90.625
SET       2.671       91.250
SET       2.671       91.875
SET       2.703       92.500
SET       2.719       93.125
SET       2.735       93.750
SET       2.751       94.062
SET       2.767       94.375
SET       2.799       94.688
SET       2.815       95.000
SET       2.831       95.312
SET       2.863       95.625
SET       2.879       95.938
SET       2.927       96.250
SET       2.975       96.562
SET       3.119       96.875
SET       3.343       97.031
SET       3.455       97.188
SET       3.567       97.344
SET       3.967       97.500
SET       4.255       97.656
SET       4.479       97.812
SET       4.703       97.969
SET       4.767       98.125
SET       4.799       98.281
SET       4.831       98.438
SET       4.863       98.516
SET       4.863       98.594
SET       4.895       98.672
SET       4.895       98.750
SET       4.927       98.828
SET       4.927       98.906
SET       4.927       98.984
SET       4.959       99.062
SET       4.991       99.141
SET       4.991       99.219
SET       5.023       99.258
SET       5.023       99.297
SET       5.023       99.336
SET       5.055       99.375
SET       5.055       99.414
SET       5.055       99.453
SET       5.087       99.492
SET       5.087       99.531
SET       5.119       99.570
SET       5.119       99.609
SET       5.151       99.629
SET       5.151       99.648
SET       5.183       99.668
SET       5.183       99.688
SET       5.183       99.707
SET       5.215       99.727
SET       5.247       99.746
SET       5.247       99.766
SET       5.279       99.785
SET       5.311       99.805
SET       5.343       99.814
SET       5.343       99.824
SET       5.375       99.834
SET       5.375       99.844
SET       5.407       99.854
SET       5.439       99.863
SET       5.471       99.873
SET       5.503       99.883
SET       5.535       99.893
SET       5.567       99.902
SET       5.599       99.907
SET       5.599       99.912
SET       5.631       99.917
SET       5.663       99.922
SET       5.663       99.927
SET       5.695       99.932
SET       5.727       99.937
SET       5.759       99.941
SET       5.791       99.946
SET       5.823       99.951
SET       5.823       99.954
SET       5.855       99.956
SET       5.887       99.958
SET       5.919       99.961
SET       5.951       99.963
SET       6.015       99.966
SET       6.079       99.968
SET       6.111       99.971
SET       6.207       99.973
SET       6.399       99.976
SET       6.527       99.977
SET       6.591       99.978
SET       6.687       99.979
SET       6.751       99.980
SET       6.783       99.982
SET       6.815       99.983
SET       6.847       99.984
SET       6.911       99.985
SET       6.975       99.987
SET       7.007       99.988
SET       7.007       99.988
SET       7.007       99.989
SET       7.039       99.990
SET       7.103       99.990
SET       7.103       99.991
SET       7.135       99.991
SET       7.167       99.992
SET       7.199       99.993
SET       7.295       99.993
SET       7.423       99.994
SET       7.487       99.994
SET       7.999       99.995
SET       8.127       99.995
SET       8.255       99.995
SET       8.575       99.995
SET      10.047       99.996
SET     434.175       99.996
SET     434.175       99.996
SET     434.175       99.997
SET     434.175       99.997
SET     434.175       99.997
[...]
SET     434.175       99.998
SET     434.175       99.998
SET     434.175       99.998
[...]
SET     434.175       99.999
SET     434.175       99.999
SET     434.175       99.999
[...]
SET     434.175      100.000
SET     434.175      100.000
SET     434.175      100.000
[...]
SET     440.319      100.000
SET     440.319      100.000
---
GET       0.647        0.000
GET       2.079        5.000
GET       2.143       10.000
GET       2.223       15.000
GET       2.319       20.000
GET       2.351       25.000
GET       2.367       30.000
GET       2.383       35.000
GET       2.399       40.000
GET       2.415       45.000
GET       2.431       50.000
GET       2.447       52.500
GET       2.447       55.000
GET       2.463       57.500
GET       2.463       60.000
GET       2.479       62.500
GET       2.479       65.000
GET       2.495       67.500
GET       2.495       70.000
GET       2.511       72.500
GET       2.511       75.000
GET       2.527       76.250
GET       2.527       77.500
GET       2.527       78.750
GET       2.543       80.000
GET       2.543       81.250
GET       2.559       82.500
GET       2.559       83.750
GET       2.575       85.000
GET       2.575       86.250
GET       2.591       87.500
GET       2.591       88.125
GET       2.607       88.750
GET       2.607       89.375
GET       2.623       90.000
GET       2.639       90.625
GET       2.655       91.250
GET       2.655       91.875
GET       2.687       92.500
GET       2.703       93.125
GET       2.719       93.750
GET       2.735       94.062
GET       2.751       94.375
GET       2.767       94.688
GET       2.799       95.000
GET       2.815       95.312
GET       2.831       95.625
GET       2.863       95.938
GET       2.895       96.250
GET       2.927       96.562
GET       3.023       96.875
GET       3.103       97.031
GET       3.327       97.188
GET       3.439       97.344
GET       3.567       97.500
GET       4.063       97.656
GET       4.287       97.812
GET       4.575       97.969
GET       4.703       98.125
GET       4.767       98.281
GET       4.799       98.438
GET       4.831       98.516
GET       4.831       98.594
GET       4.863       98.672
GET       4.863       98.750
GET       4.895       98.828
GET       4.895       98.906
GET       4.927       98.984
GET       4.959       99.062
GET       4.959       99.141
GET       4.991       99.219
GET       4.991       99.258
GET       4.991       99.297
GET       5.023       99.336
GET       5.023       99.375
GET       5.023       99.414
GET       5.055       99.453
GET       5.055       99.492
GET       5.087       99.531
GET       5.087       99.570
GET       5.119       99.609
GET       5.119       99.629
GET       5.151       99.648
GET       5.151       99.668
GET       5.183       99.688
GET       5.183       99.707
GET       5.215       99.727
GET       5.215       99.746
GET       5.247       99.766
GET       5.279       99.785
GET       5.311       99.805
GET       5.311       99.814
GET       5.343       99.824
GET       5.375       99.834
GET       5.375       99.844
GET       5.407       99.854
GET       5.439       99.863
GET       5.471       99.873
GET       5.503       99.883
GET       5.535       99.893
GET       5.567       99.902
GET       5.567       99.907
GET       5.599       99.912
GET       5.631       99.917
GET       5.631       99.922
GET       5.663       99.927
GET       5.695       99.932
GET       5.695       99.937
GET       5.727       99.941
GET       5.759       99.946
GET       5.791       99.951
GET       5.791       99.954
GET       5.823       99.956
GET       5.855       99.958
GET       5.887       99.961
GET       5.951       99.963
GET       6.015       99.966
GET       6.079       99.968
GET       6.175       99.971
GET       6.303       99.973
GET       6.559       99.976
GET       6.623       99.977
GET       6.687       99.978
GET       6.751       99.979
GET       6.783       99.980
GET       6.815       99.982
GET       6.879       99.983
GET       6.943       99.984
GET       6.975       99.985
GET       7.007       99.987
GET       7.039       99.988
GET       7.071       99.988
GET       7.103       99.989
GET       7.103       99.990
GET       7.135       99.990
GET       7.167       99.991
GET       7.199       99.991
GET       7.295       99.992
GET       7.487       99.993
GET       8.127       99.993
GET       8.319       99.994
GET       8.575       99.994
GET       9.791       99.995
GET      10.111       99.995
GET     434.175       99.995
GET     434.175       99.995
GET     434.175       99.996
GET     434.175       99.996
GET     434.175       99.996
GET     434.175       99.997
GET     434.175       99.997
GET     434.175       99.997
[...]
GET     434.175       99.998
GET     434.175       99.998
GET     434.175       99.998
[...]
GET     434.175       99.999
GET     434.175       99.999
GET     434.175       99.999
[...]
GET     434.175      100.000
GET     434.175      100.000
GET     434.175      100.000
[...]
GET     438.271      100.000
GET     438.271      100.000
GET     438.271      100.000
[...]
GET     440.319      100.000
GET     440.319      100.000
---
WAIT      0.000      100.000